[tasks]
one
two

[options]
mode prove
multiclock on
one: depth   20
two: depth  120

[engines]
smtbmc

[script]
read -define F_OPT_CLK2FFLOGIC
read -define RXUARTLITE
one: read -sv              -formal rxuartlite.v
two: read -sv -D PHASE_TWO -formal rxuartlite.v
chparam -set CLOCKS_PER_BAUD 16 rxuartlite
prep -top rxuartlite
# opt_merge -share_all

[files]
../../rtl/rxuartlite.v
