[tasks]
prf
cvr

[options]
prf: mode prove
cvr: mode cover
multiclock on
prf: depth  110
cvr: depth  720

[engines]
smtbmc boolector

[script]
prf: read -formal -DRXUARTLITE -D PHASE_TWO rxuartlite.v
cvr: read -formal -DRXUARTLITE -D PHASE_TWO rxuartlite.v
chparam -set CLOCKS_PER_BAUD 16 rxuartlite
prep -top rxuartlite
# opt_merge -share_all

[files]
../../rtl/rxuartlite.v
