read_verilog -D TXUARTLITE -formal ../../rtl/txuartlite.v
prep -top txuartlite -nordff
clk2fflogic
opt -share_all
write_smt2 -wires txuartlite.smt2
